Merge pull request #249 from cmudco/docs/dare-docs-source-cleanup
Update DARE docs naming and architecture diagrams
